In [2]:
# import Libraries pandas , numpy 
import pandas as pd  

import numpy as np 

print(f"Pandas version: {pd.__version__}")
print(f"Numpy version: {np.__version__}")

Pandas version: 2.3.3
Numpy version: 2.3.4

# Creating a Data Frame
- Data enclosed in a Dictionary

In [ ]:
# create DataFrame in pandas

# We can write everything in single or double quotes 
mydata = pd.DataFrame({
    'Name': ['Naruto', 'Ichigo', 'Luffy', 'Goku'],
    'Anime': ["Naruto", "Bleach", "One Piece", "Dragon Ball"],
    "Studio": ['Pierrot', 'Pierrot', 'Toei Animation', 'Toei Animation'], 
    "Episodes": [220, 366, 1000, 153],
    "Rating": [8.3, 7.9, 8.8, 8.5]
})

# And in a single line too 

fruits = pd.DataFrame({'Fruits':['Apples','Mangoes','Grapes','Oranges'],"Quantity":[100,360,20,180]})

In [17]:
mydata

     Name        Anime          Studio  Episodes  Rating
0  Naruto       Naruto         Pierrot       220     8.3
1  Ichigo       Bleach         Pierrot       366     7.9
2   Luffy    One Piece  Toei Animation      1000     8.8
3    Goku  Dragon Ball  Toei Animation       153     8.5

In [19]:
fruits

    Fruits  Quantity
0   Apples       100
1  Mangoes       360
2   Grapes        20
3  Oranges       180

# Creating A Series 
- Data enclosed in a list

In [21]:
# Series is one Dimensional Array
# Creating A Series 

s = pd.Series([10, 20, 30, 40, 50])

s

0    10
1    20
2    30
3    40
4    50
dtype: int64